Revit 2027 API
ParameterTypeId.BoundaryYRotationFixed Property
 "Y Rotation - Fixed"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId BoundaryYRotationFixed { get; }
Public Shared ReadOnly Property BoundaryYRotationFixed As ForgeTypeId
	Get
public:
static property ForgeTypeId^ BoundaryYRotationFixed {
	ForgeTypeId^ get ();
}
static member BoundaryYRotationFixed : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace